class YandexScooterHomePageFAQ:
    answer_1 = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    answer_2 = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    answer_3 = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    answer_4 = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    answer_5 = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    answer_6 = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    answer_7 = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    answer_8 = "Да, обязательно. Всем самокатов! И Москве, и Московской области."


class YandexScooterOrderForm:
    data_sets = {
        'data_set_1': {
            'first_name': 'Антон',
            'last_name': 'Пупкин',
            'address': 'Дефолтная улица',
            'subway_name': 'Чистые пруды',
            'telephone_number': '79510025544',
            'date': '05.01.2025',
            'rent_period': 0,
            'color': [0],
            'comment_for_courier': 'Корректный комментарий для курьера',
            'description': 'Корректные данные'
        },
        'data_set_2':
            {'first_name': 'Василий',
             'last_name': 'Митрофанов',
             'address': 'Дефолтный проспект',
             'subway_name': 'Черкизовская',
             'telephone_number': '79510025555',
             'date': '06.01.2025',
             'rent_period': 3,
             'color': [1],
             'comment_for_courier': 'Корректный комментарий для курьера',
             'description': 'Корректные данные'
             },
    }